cf_billing/Catalogs/энргШаблоныСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргШаблоныСообщений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/энргШаблоныСообщений/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.ТипОбъекта) Тогда 
		
		ОбъектПотребителя = Метаданные.НайтиПоПолномуИмени(Объект.ТипОбъекта);
		Если ОбъектПотребителя <> Неопределено Тогда 
			ПредставлениеОбъекта = ?(ОбъектПотребителя.Синоним = "", ОбъектПотребителя.Имя, ОбъектПотребителя.Синоним); 
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьКоманды();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВставитьПараметр(Команда)
	Элементы.ТекстШаблона.ВыделенныйТекст = ВставитьПараметрНаСервере(Команда.Имя);
КонецПроцедуры

&НаСервере
Функция ВставитьПараметрНаСервере(ИмяКоманды)
	Возврат Справочники.энргШаблоныСообщений.ЗаменаКоманды(ИмяКоманды, "КомандаПарам"); 
КонецФункции

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипОбъектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Оповещение = Новый ОписаниеОповещения("ТипОбъектаНачалоВыбораЗавершение", ЭтаФорма);
	ПараметрФормы = Новый Структура;
	ПараметрФормы.Вставить("ТекущаяСтрока", Объект.ТипОбъекта);
	
	Результат = ОткрытьФорму("Справочник.энргШаблоныСообщений.Форма.ВыборОбъектаМетаданных", 
		ПараметрФормы, ЭтаФорма ,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	

КонецПроцедуры

&НаКлиенте
Процедура ТипОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ПредставлениеОбъекта = ВыбранноеЗначение.Представление;
		Объект.ТипОбъекта = ВыбранноеЗначение.Значение;
		Модифицированность = Истина;
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте 
Процедура ТипОбъектаНачалоВыбораЗавершение(Результат, ПараметрыОповещения) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда 
		Объект.ТипОбъекта = Результат.Имя;
		ПредставлениеОбъекта = Результат.Синоним;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКоманды(ИмяГруппыКоманд = "КомандыПараметрыШаблона", ПрефиксКоманд = "КомандаПарам", ДействиеКоманды = "ВставитьПараметр")
	Если ЗначениеЗаполнено(Объект.ТипОбъекта) Тогда
		Попытка
			Менеджер = Новый (СтрЗаменить(Объект.ТипОбъекта, ".", "Менеджер."));
			СписокПараметров = Менеджер.СписокПараметровДляШаблона();
			
			Для каждого ТекПарам Из СписокПараметров Цикл
				// Добавление команды
				ИмяКмд = ПрефиксКоманд + ТекПарам.Значение;
				
				Кмд = ЭтаФорма.Команды.Добавить(ИмяКмд);
				Кмд.Действие				  = ДействиеКоманды;
				Кмд.Заголовок				  = "@" + ТекПарам.Значение + "@";
				Кмд.ИзменяетСохраняемыеДанные = Истина;
				
				// Добавление новой кнопки
				ЭлементКМД = ЭтаФорма.Элементы.Добавить(ИмяКмд, Тип("КнопкаФормы"), ЭтаФорма.Элементы[ИмяГруппыКоманд]);
				ЭлементКМД.Вид 			= ВидКнопкиФормы.ОбычнаяКнопка;
				ЭлементКМД.ИмяКоманды	= ИмяКмд;
			КонецЦикла;
			
			
		Исключение
			Для Каждого ТекКоманда Из ЭтаФорма.Команды Цикл
				ЭтаФорма.Команды.Удалить(ТекКоманда);
			КонецЦикла;
		КонецПопытки;
	Иначе		
		Для Каждого ТекКоманда Из ЭтаФорма.Команды Цикл
			ЭтаФорма.Команды.Удалить(ТекКоманда);
		КонецЦикла;
	КонецЕсли;	
		
КонецПроцедуры




#КонецОбласти
